yuplus/nxp-mcx-series/MCXE247/drivers/fsl_lpspi.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2022, 2024-2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_lpspi.h"
/*
 * $Coverage Justification Reference$
 *
 * $Justification fsl_lpspi_c_ref_1$
 * The default branch cannot be executed in any circumstances, it is only added to avoid MISRA violation.
 *
 * $Justification fsl_lpspi_c_ref_2$
 * The FIFO was emptied before the check and there was no writing after the FIFO was emptied, so the obtained FIFO count
 * is 0, and the #kStatus_LPSPI_Timeout cannot be obtained.(will improve)
 *
 * $Justification fsl_lpspi_c_ref_3$
 * The fifosize is determined by the hardware.
 *
 * $Justification fsl_lpspi_c_ref_4$
 * If an interrupt is generated by this error, the corresponding interrupt bit must be set.(will improve)
 *
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.lpspi"
#endif

#if defined(LPSPI_RSTS)
#define LPSPI_RESETS_ARRAY LPSPI_RSTS
#endif

/*!
 * @brief Default watermark values.
 *
 * The default watermarks are set to zero.
 */
enum _lpspi_default_watermarks
{
    kLpspiDefaultTxWatermark = 0,
    kLpspiDefaultRxWatermark = 0,
};

/*
 * <! Structure definition for variables that passed as parameters in LPSPI_MasterTransferBlocking.
 *  The structure is private.
 */
typedef struct _lpspi_transfer_blocking_param
{
    bool isTxMask;
    bool isPcsContinuous;
    uint8_t bytesEachWrite;
    uint8_t bytesEachRead;
    const uint8_t *txData;
    uint8_t *rxData;
    uint32_t rxRemainingByteCount;
} lpspi_transfer_blocking_param_t;

/*! @brief Typedef for master interrupt handler. */
typedef void (*lpspi_master_isr_t)(LPSPI_Type *base, lpspi_master_handle_t *handle);

/*! @brief Typedef for slave interrupt handler. */
typedef void (*lpspi_slave_isr_t)(LPSPI_Type *base, lpspi_slave_handle_t *handle);

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*!
 * @brief Configures the LPSPI peripheral chip select polarity.
 *
 * This function  takes in the desired peripheral chip select (Pcs) and it's corresponding desired polarity and
 * configures the Pcs signal to operate with the desired characteristic.
 *
 * @param base LPSPI peripheral address.
 * @param pcs The particular peripheral chip select (parameter value is of type lpspi_which_pcs_t) for which we wish to
 *            apply the active high or active low characteristic.
 * @param activeLowOrHigh The setting for either "active high, inactive low (0)"  or "active low, inactive high(1)" of
 *                        type lpspi_pcs_polarity_config_t.
 */
static void LPSPI_SetOnePcsPolarity(LPSPI_Type *base,
                                    lpspi_which_pcs_t pcs,
                                    lpspi_pcs_polarity_config_t activeLowOrHigh);

/*!
 * @brief Combine the write data for 1 byte to 4 bytes.
 * This is not a public API.
 */
static uint32_t LPSPI_CombineWriteData(const uint8_t *txData, uint8_t bytesEachWrite, bool isByteSwap);

/*!
 * @brief Separate the read data for 1 byte to 4 bytes.
 * This is not a public API.
 */
static void LPSPI_SeparateReadData(uint8_t *rxData, uint32_t readData, uint8_t bytesEachRead, bool isByteSwap);

/*!
 * @brief Master fill up the TX FIFO with data.
 * This is not a public API.
 */
static void LPSPI_MasterTransferFillUpTxFifo(LPSPI_Type *base, lpspi_master_handle_t *handle);

/*!
 * @brief Master finish up a transfer.
 * It would call back if there is callback function and set the state to idle.
 * This is not a public API.
 */
static void LPSPI_MasterTransferComplete(LPSPI_Type *base, lpspi_master_handle_t *handle);

/*!
 * @brief Slave fill up the TX FIFO with data.
 * This is not a public API.
 */
static void LPSPI_SlaveTransferFillUpTxFifo(LPSPI_Type *base, lpspi_slave_handle_t *handle);

/*!
 * @brief Slave finish up a transfer.
 * It would call back if there is callback function and set the state to idle.
 * This is not a public API.
 */
static void LPSPI_SlaveTransferComplete(LPSPI_Type *base, lpspi_slave_handle_t *handle);

/*!
 * @brief LPSPI common interrupt handler.
 *
 * @param handle pointer to s_lpspiHandle which stores the transfer state.
 */
static void LPSPI_CommonIRQHandler(LPSPI_Type *base, void *param);

/*!
 * @brief introduce function static bool LPSPI_MasterTransferWriteAllTxData.
 * This function was deal with write all Txdata.
 *
 * @param base LPSPI peripheral address.
 * @param stateParams Pass the address of the parent function variable.
 *
 * @return default is true when No abnormality.
 * @return false when time out.
 */
static bool LPSPI_MasterTransferWriteAllTxData(LPSPI_Type *base,
                                               lpspi_transfer_t *transfer,
                                               lpspi_transfer_blocking_param_t *stateParams);

/*!
 * @brief introduce function LPSPI_MasterTransferClearTCR.
 * This function was deal with clear TCR.
 *
 * @param base LPSPI peripheral address.
 * @param stateParams Pass the address of the parent function variable.
 *
 * @return default is true when No abnormality.
 * @return false when time out.
 */
static bool LPSPI_MasterTransferClearTCR(LPSPI_Type *base, lpspi_transfer_blocking_param_t *stateParams);

/*!
 * @brief introduce function LPSPI_MasterTransferReadDataInFifo.
 * This function was deal with read data in fifo.
 *
 * @param base LPSPI peripheral address.
 * @param stateParams Pass the address of the parent function variable.
 *
 * @return default is true when No abnormality.
 * @return false when time out.
 */
static bool LPSPI_MasterTransferReadDataInFifo(LPSPI_Type *base,
                                               lpspi_transfer_t *transfer,
                                               lpspi_transfer_blocking_param_t *stateParams);

/*!
 * @brief introduce function LPSPI_MasterTransferReadDataInFifoNoBuf.
 * This function was deal with no buf in fifo.
 *
 * @param base LPSPI peripheral address.
 * @param stateParams Pass the address of the parent function variable.
 *
 * @return default is true when No abnormality.
 * @return false when time out.
 */
static bool LPSPI_MasterTransferReadDataInFifoNoBuf(LPSPI_Type *base, lpspi_transfer_blocking_param_t *stateParams);

