yuplus/nxp-mcx-series/MCXE247/drivers/fsl_lpspi.c
    /* If there is no rxData, mask the receive data so that receive data is not stored in receive FIFO. */
    if (handle->rxData == NULL)
    {
        isRxMask                     = true;
        handle->rxRemainingByteCount = 0;
    }

    /* Mask tx data in half duplex mode since the tx/rx share the same pin, so that the data received from slave is not
     * interfered. */
    if (((temp == LPSPI_CFGR1_PINCFG(kLPSPI_SdiInSdiOut)) || (temp == LPSPI_CFGR1_PINCFG(kLPSPI_SdoInSdoOut))) &&
        (handle->txData == NULL))
    {
        handle->isTxMask = true;

        if (isPcsContinuous && (handle->bytesPerFrame > 4U))
        {
            /* Workaround for ERR050607 */
            frameSizeNew          = 31U;
            handle->bytesPerFrame = 4;
        }
    }

    /*Transfers will stall when transmit FIFO is empty or receive FIFO is full. */
    base->CFGR1 &= (~LPSPI_CFGR1_NOSTALL_MASK);

    /* Enable module for following configuration of TCR to take effect. */
    LPSPI_Enable(base, true);

    /* Configure transfer control register. */
    base->TCR = (LPSPI_GetTcr(base) & ~(LPSPI_TCR_CONT_MASK | LPSPI_TCR_CONTC_MASK | LPSPI_TCR_RXMSK_MASK |
                                        LPSPI_TCR_TXMSK_MASK | LPSPI_TCR_PCS_MASK)) |
                LPSPI_TCR_PCS(whichPcs);

    /*TCR is also shared the FIFO , so wait for TCR written.*/
    /*
     * $Branch Coverage Justification$
     * $ref fsl_lpspi_c_ref_2$
     */
    if (!LPSPI_WaitTxFifoEmpty(base))
    {
        return kStatus_LPSPI_Timeout;
    }

    /* PCS should be configured separately from the other bits, otherwise it will not take effect. */
    base->TCR = (LPSPI_GetTcr(base) & ~LPSPI_TCR_FRAMESZ_MASK) | LPSPI_TCR_CONT(isPcsContinuous) |
                LPSPI_TCR_CONTC(isPcsContinuous) | LPSPI_TCR_RXMSK(isRxMask) | LPSPI_TCR_FRAMESZ(frameSizeNew);

#if defined(LPSPI_IRQS)
    /* Enable the NVIC for LPSPI peripheral. Note that below code is useless if the LPSPI interrupt is in INTMUX ,
     * and you should also enable the INTMUX interupt in your application.
     */
    (void)EnableIRQ(s_lpspiIRQ[LPSPI_GetInstance(base)]);
#endif

    /* TCR is also shared the FIFO, so wait for TCR written. */
    /*
     * $Branch Coverage Justification$
     * $ref fsl_lpspi_c_ref_2$
     */
    if (!LPSPI_WaitTxFifoEmpty(base))
    {
        return kStatus_LPSPI_Timeout;
    }

    if (handle->isTxMask)
    {
        /* When TCR[TXMSK]=1, transfer is initiate by writting a new command word to TCR. TCR[TXMSK] is cleared by
         * hardware every time when TCR[FRAMESZ]+1 bit of data is transfered. In this case TCR[TXMSK] should be set to
         * initiate each transfer.
         */
        base->TCR = LPSPI_GetTcr(base) | LPSPI_TCR_TXMSK_MASK;
        handle->txRemainingByteCount -= (uint32_t)handle->bytesPerFrame;
        if (!LPSPI_WaitTxFifoEmpty(base))
        {
            return kStatus_LPSPI_Timeout;
        }
    }
    else
    {
        /* Fill up the TX data in FIFO to initiate transfer */
        LPSPI_MasterTransferFillUpTxFifo(base, handle);
    }

    /* Since SPI is a synchronous interface, we only need to enable the RX interrupt if there is RX data.
     * The IRQ handler will get the status of RX and TX interrupt flags.
     */
    if (handle->rxData != NULL)
    {
        if (handle->isTxMask)
        {
            /* If tx data is masked, transfer is initiated by writing 1 to TCR[TXMSK] and TCR[FRMESZ]+1 bits of data is
             * read. If rx water mark is set larger than TCR[FRMESZ]+1, rx interrupt will not be generated. Lower the rx
             * water mark setting
             */
            if ((handle->bytesPerFrame / 4U) <= (uint16_t)handle->rxWatermark)
            {
                handle->rxWatermark =
                    (uint8_t)(handle->bytesPerFrame / 4U) > 0U ? (uint8_t)(handle->bytesPerFrame / 4U - 1U) : 0U;
                base->FCR = (base->FCR & (~LPSPI_FCR_RXWATER_MASK)) | LPSPI_FCR_RXWATER(handle->rxWatermark);
            }
        }
        else
        {
            /* Set rxWatermark to (readRegRemainingTimes-1) if readRegRemainingTimes less than rxWatermark. Otherwise
             * there is not RX interrupt for the last datas because the RX count is not greater than rxWatermark.
             */
            if (handle->readRegRemainingTimes <= handle->rxWatermark)
            {
                base->FCR =
                    (base->FCR & (~LPSPI_FCR_RXWATER_MASK)) | LPSPI_FCR_RXWATER(handle->readRegRemainingTimes - 1U);
            }
        }

        LPSPI_EnableInterrupts(base, (uint32_t)kLPSPI_RxInterruptEnable);
    }
    else
    {
        LPSPI_EnableInterrupts(base, (uint32_t)kLPSPI_TxInterruptEnable);
    }

    return kStatus_Success;
}

static void LPSPI_MasterTransferFillUpTxFifo(LPSPI_Type *base, lpspi_master_handle_t *handle)
{
    assert(handle != NULL);

    uint32_t wordToSend             = 0;
    uint8_t fifoSize                = handle->fifoSize;
    uint32_t writeRegRemainingTimes = handle->writeRegRemainingTimes;
    uint32_t readRegRemainingTimes  = handle->readRegRemainingTimes;
    size_t txRemainingByteCount     = handle->txRemainingByteCount;
    uint8_t bytesEachWrite          = handle->bytesEachWrite;
    bool isByteSwap                 = handle->isByteSwap;

    /* Make sure the difference in remaining TX and RX byte counts does not exceed FIFO depth
     * and that the number of TX FIFO entries does not exceed the FIFO depth.
     * But no need to make the protection if there is no rxData.
     */
    while ((LPSPI_GetTxFifoCount(base) < fifoSize) &&
           (((readRegRemainingTimes - writeRegRemainingTimes) < (uint32_t)fifoSize) || (handle->rxData == NULL)))
    {
        if (txRemainingByteCount < (size_t)bytesEachWrite)
        {
            handle->bytesEachWrite = (uint8_t)txRemainingByteCount;
            bytesEachWrite         = handle->bytesEachWrite;
        }

